# 2) რა არის სია (list) და როგორ უნდა შევქმნათ
# სია არის მონაცემთა სტრუქტურა, რომელიც საშუალებას გვაძლევს 
# შევინახოთ მრავალი ელემენტი ერთ ცვლადში. 
# სიები შესაძლებელია შეიცავდეს სხვადასხვა ტიპის ელემენტებს: int, str, float, და ა.შ.
# სიების ელემენტები იდენტიფიცირდება ინდექსით (0-დან დაწყებული)
# სიას ვქმნით კვადრატული ფრჩხილებით []


fruits = ["apple", "banana", "orange"]
print(fruits)


# 3) ინდექსი
# ინდექსი არის რიცხვითი პოზიცია სიაში. 
# პირველი ელემენტი არის 0 ინდექსზე, მეორე 1-ზე და ასე შემდეგ.
# ინდექსის გამოყენებით შეგვიძლია მივმართოთ სიას და შევცვალოთ ან წავშალოთ ელემენტები.


# 4) 7 ელემენტიანი სახელების სია
names = ["Nika", "Giorgi", "Tamar", "Ana", "Levan", "Mari", "Saba"]

# შეცვლა 1-ლი და მე-5 ინდექსზე
names[0] = "Irakli"  
names[4] = "Keti"     

print(names)



# 5) სია სხვადასხვა ტიპის ელემენტებით და ელემენტების არჩევა
my_list = [10, "hello", 3.14, "world", True, "Python", 7]

print(my_list[1])  
print(my_list[3])  
print(my_list[5])  




# 6) სია vs ცვლადი
# ცვლადი ინახავს ერთელემენტურ მონაცემს (მაგალითად რიცხვს ან სტრინგს)
# სია კი ინახავს მრავალელემენტურ მონაცემთა სტრუქტურას ერთ ცვლადში
# მაგალითი:
x = 10          # ცვლადი
numbers = [1,2,3,4,5]   # სია
