# 1) დაიყენეთ გოას ლეგენდის  ფოტო

# 2) კომენტარებით ახსენით თუ რას აკეთებს .upper(); .lower(); .capitalize(); .find() ფუნქციები.

# .upper() -> გარდაქმნის სტრინგში ყველა ასოს დიდ ასოებად
# .lower() -> სტრინგში ყველა ასოს გარდაქმნის პატარა  ასოებად
# .capitalize() -> სტრინგში მხოლოდ პირველ ასოს გაადიდებს
# .find() -> არგუმენტად რა ასოსაც  გადავცემთ, იმ ასოს ინდექსს მოგვცემს სტრინგში

# 3) მომხმარებელს შემოატანინეთ წინადადება და დაბეჭდეთ იგი პატარა ასოებით.

a=input("დაწერე რაიმე სიტყვა")
print(a.upper())


# 4) მომხმარებელს შემოატანინეთ ელფოსტის მისამართი და გადაამოწმეთ შეიცავს თუ არა '@' სიმბოლოს, შედეგი კი დაბეჭდეთ დიდი ასოებით.

b=input("დაწერე ელფოსტის მისამართი")
if b ==  b + "@" :
    print(b)

else :
    print(b.upper())

# 5) მომხმარებელს შემოატანინეთ წიგნის დასახელება და შედეგი დაბეჭდეთ სათაურის სტილში.
e=input("დაწერე რაიმე წიგნის დასახელება")
print(e.upper())


# 6) მომხმარებელს შემოატანინეთ წინადადება და სიმბოლო. თქვენი დავალებაა დაითვალოთ რამდენჯერ გვხვდება ეს სიმბოლო წინადადებაში.

h=input("დაწერე რაიმე სიტყვა")
i=input("დაწერე რაიმე სიმბოლო")
print(h.find(i))

# 7) მომხმარებელს შემოატანინეთ სიტყვა და შეამოწმეთ, არის თუ არა იგი დიდი ასოებით, თუ კი — დაბეჭდე "სიტყვა უკვე დიდია!", თუ არა — გადააქციე და დაბეჭდე.
f=input("დაწერე რაიმე სიტყვა")
if f.isupper():
    print("სიტყვა უკვე დიდია!")
else:
    print(f.upper())




