# 1) კომენტარების სახით ახსენით რა არის "კომენტარი", როგორ უნდა შევქმნათ და რა დანიშულება გააჩნია.
# კომენტარი არის რისი დახმარებითაც ვხვდებით რა კოდი რა არის ანუ კომენტარს (#) ყურადღებას არ აქცევს კოპიუტერი 

# 2) კომენტარების სახით ახსენით რა არის case-sensitive.
#case-sensitive ნიშნავს, რომ სისტემა ან პროგრამა განსხვავებას ხედავს დიდ და პატარა ასოებს შორის.

# 4) კომენტარებით ახსენით რა არის snake_case-ი და შექმენით მისი გამოყენებით რამდენიმე ცვლადი შესაბამისი მნიშვნელობებით. შეეცადეთ ააწყოთ ასეთი ცვლადებით ერთი დიდი წინადადება >3
#snake_case - არის სახელდების სტილი  სადაც სიტყვები ერთმანეთისგან გამოყოფილია ქვედა ტირეთი _ და ყველა ასო ჩვეულებრივ პატარაა
ა = 'ას'
ბ = "ასდფ"
გ = "ასდფგ"
print (ა + ბ + გ )
# 5) კომენტარებით ახსენით რა არის bug და debugging-ი.
#bug - არის როდესაც კოდში რაღაც არასწორია 
#debugging - არის სადაც მონიშნავ იქამდე გააივლი კოდს

# გამოასწორეთ შეცდომები შემდეგ კოდში:

# print("Hello World")
# city = "London"
# print(City)

# 6) შეასრელეთ sololearn შემდეგ თავამდე:
