  # 1) თქვენი სიტყვებით ახსენით რა არის if,და რაში გვეხმარება?
  
# if არის პითონის ერთ-ერთი ფუნქცია რომელიც აღნიშნავს რა შემთხვევაში რა უნდა ქნა

  # 2) რას ნიშნავს if? elif? else?
# if არის ამ შემთხვევაში ეს უნდა ქნნა და elif თუ არა და ეს და else  არის თუ არცერთი არ არის არც if   და არც elif

  # 3)მომხმარებელს შეეკითხეთ ასაკი,თუ ასაკი მეტი ან ტოლი იქნება 18-ზე,გამოიტანეთ "უნივერსიტეტი" თუ ქინება 7 მეტია ან ტოლი მაშინ "სკოლა",დანარჩენ შემთხვევაში "ბაღი"

user_old=int(input("დაწერე შენი ასაკი: "))
if user_old >= 18 :
    print("უნივერსიტეტი")
      
elif user_old >= 7  :
    print("სკოლა")
    
else : 
    print("ბაღი")


  # 4)მოსწავლეს შეეკითხეთ მის მიერ მიღებული ქულა,თუ ქულა უდრის 100-ს მაშინ გამოუტანეთ "A Group),თუ იქნება 80-დან 99-მდე მაშინ გამოიტანეთ "B Group",თუ იქნება 40-დან 79-მდე მაშინ "C Group",დანარჩენ შემთხვევაში კი "D Group"

user_ქულა=int(input("დაწერე შენს მიერ მიღებული ქულა: "))
if user_ქულა == 100 :
     print("A GROUP" )
elif user_ქულა >= 80 and  user_ქულა < 99 :
     print( "B GROUP" )
elif user_ქულა >= 40 and user_ქულა < 79 :
     print("C GROUP")
else :
     print("D GROUP")

# 5)მომხმარებელს შეეკითხეთ მისი სახელი,თუ ამ სახელში იქნება ხმოვნები გამოიტანეთ ეს ხმოვნები,თუ არ იქნება გამოიტანეთ "არ არის ხმოვნები"

user_name = input("დაწერე შენი სახელი: ")
s = ""
vowels = "ა ე ი ო უ "
for i in user_name :
     if i in vowels :
          s += i

if s == "" :
     print("არ  არის  ხმოვნები ")
else :
     print(s)




# aieou = False
# for ch in user_name :
#      if ch == "ა":
#           print("ა")
#           aieou = True

#      if ch == "ე" :
#           print("ე")
#           aieou = True

#      if ch == "ი" :
#           print("ი")
#           aieou = True

#      if ch == "ო" :
#           print("ო")
#           aieou = True

#      if ch == "უ" :
#           print("უ")
#           aieou = True

# if aieou == False :
#     print("ხმოვანი არ არის") 




           
 


  # 6)მომხარებელს შეეკითხეთ მისი ასაკი და გამოითვალეთ რამდენის იქნება 20 წლის შემდეგ,თუ ასასკი მეტი ან ტოლი იქნება 40-ის გამოიტანეთ "მოგემატა ასაკი",სხვა შემთხვევაში "მალე მოგემატება ასაკი:

user_old = int(input("დაწერე შენი ასაკი: "))
if 20 + user_old >= 40:
     print("მოგრმატათ ასაკი")
else :
     print("მალე მოგემატება ასაკი")



