# 1) შექმენი ერთი ცვლადი სადაც შემოიტან შენს ასაკს, შემდეგ დაპრინტე შედეგი
a = 14
print(a)

# 2) კომენტარის სახით ახსენი რა არის input და რა არის output და ასევე ახსენი განსხვავება მათ შორის
#input - როცა ბრძანებს იღებს 
#output - როცა ბრძანებას გასცემს 

# 3) შექმენი ორი ცვლადი, სადაც შემოიტან ორ რიცხვს, შემდეგ ამ რიცხვებს შორის მოახდინე: მიმატება, გამოკლება, გამრავლება და გაყოფა
f = 23
d = 233
print(f + d )
print(f - d )
print(f * d )
print(f // d )

# 4) მომხმარებელს შემოატანინე თავის საყვარელი ფერი, ცხოველი და დასასვენებელი კურორტი ან ქვეყანა, შემდეგ დაპრინე წინადადება მაგალითად: "Your favorites are: Color: " ლურჯი ", Animal: " + ძაღლი + ", Place: " + ეიფელის კოშკი)
a = input("დაწერე შენი საყვარელი ფერი ")
b = input("დაწერე შენი საყვარელი ცხოველი ")
c = input("დაწერე შენი საყვარელი დასასვენებელი კურორტი ")
d = input("დაწერე შენი საყვარელი ცხოველი ქვეყანა ")
print("Your favorites are: Color: " + a)

# 5) input ად შემოიტანე 4 მანქანის სახელი და მოდელი შემდეგ დაპრინტე ისინი შენი გემოვნებით, ანუ პირველი დაპრინტე იმ მანქანის სახელი რომელიც ყველაზე მეტად მოგწონს მაგ ინფუთიდან
a = input("შენი საყვარელი მანქა")