#1 დაბეჭდე რიცხვები 1-დან 10-მდე.
#2 დაბეჭდე ყველა ლუწი რიცხვი 1-დან 20-მდე.
#3 დაბეჭდე ყველა კენტი რიცხვი 2-დან 20-მდე.
#4 მომხ. შეყვანილი რიცხვიდან დაითვალე 0-მდე უკუღმა.
#5 დათვალე 1-დან 100-მდე რიცხვების ჯამი.
#6 მომხმარებელს შეეკითხე რიცხვი სანამ დადებითს არ შეიყვანს
#7 დაბეჭდე კვადრატები 1-დან 10-მდე.
#8 დაბეჭდე “Hello” 5-ჯერ.
#9 დაბეჭდე 1-დან 30-მდე ის რიცხვები, რომლებიც 3-ის ჯერადია.

# 1
# i = 1
# while i < 10 :
#     print(i)
#     i+=1


# # # 2

# a = 2
# while a <= 20:
#     print(a)       
#     a += 2

# 3
# i = 3
# while i <=20:
#     print(i)
#     i+= 2
# # 4
# a = int(input("შემოიყვანე  რაიმე რიცხვი :"))
# while a >= 0:
#     print(a)
#     a -= 1

# 5
# i =1 
# a = 0 

# while i <= 100:
#     a += i
#     i += 1
# print(a)

# # 6
# i = int(input("შემოიყვანე რაიმე რიცხვი :"))

# while i >= 0 :
#     i = int(input("თავიდან შემოიყვანე   :"))
# print("გაიხარე")

# # 7
# i = 1
# while i  <= 10 :
#     print(i ** 2 )
#     i += 1


# 8
i = 1
while i <= 5:
    print("hello")
    i +=1 

# 9




