# 1)დაწერეთ 2-2 მაგალითი შედარების ოპერატორებზე (>, <, <=, >=, ==)



# 6 > 2   -> True
# 3 > 9   -> False


# 1 < 5   -> True
# 8 < 4   -> False


# 7 <= 7  -> True
# 10 <= 3 -> False


# 9 >= 9  -> True
# 2 >= 6  -> False


# 5 == 5  -> True
# 4 == 1  -> False


# 2) თქვენი სიტყვებით ახსენით რა არის binary code და რასთან კავშირშია 0-ები და 1-ები?


# Binary code ბინარული კოდი არის სისტემა, რომელიც იყენებს მხოლოდ ორ ციფრს: 0 და 1.
# კომპიუტერი მუშაობს ელექტრონულ სიგნალებზე:
# 0 ნიშნავს გამორთულ მდგომარეობას
# 1 ნიშნავს ჩართულ მდგომარეობას
# ამ 0-ებისა და 1-ების კომბინაციებით კომპიუტერი ამუშავებს ყველა ინფორმაციას.
# ანუ ბინარული კოდი არის კომპიუტერის ენა.
