# 1) მომხმარებელს შემოატანინეთ input-ის მეშვეობით თავისი სახელი, შეინახეთ იგი ცვლადში და ბეჭდეთ მიღებული მნიშვნელობა.
a = input("დაწერე შენი სახელი :") 
print(a)



# 2) მომხარებელს შემოატანინეთ 2 ცალი რიცხვი სხვადასხვა დამოუკიდებელი input-ის მეშვეობით, ამის შემდეგ კი უბრალოდ დაბეჭდეთ ამ შემოყვანილი რიცხვების ჯამი. (დაგჭირდებათ int() ფუნქცია)
a = int(input("დაწერე რაიმე რიცხვი :"))
b = int(input("კიდე დაწერე რაიმე რიცხვი :"))
print(a + b )

# 3) მომხმარებელს შემოატანინეთ თავისი ასაკი, თქვენი დავალებაა შემოყვანილი მნიშვნელობა გადაიყვანოთ integer ტიპის მონმაცემად და საბოლოოდ დაბეჭდოთ მომხმარებლის მიერ შემოყვანილი მნიშვნელობის მონაცემთა ტიპი.
c = int(input("დაწერე შენი ასაკი : "))
print(c)

# 4) შექმენით 3 ცვლადი, თითოულ ცვლადში შეინახეთ 1 მონაცემთა ტიპის მნიშვნელობა, თქვენი დავალებაა კი საბოლოოდ დაბეჭდოთ ამ ცვლადების მონაცემტა ტიპები.
a = "df"
b = 12
c = 1.1
print(type( "a = str", "b = int","c = float"  ))