# 2) კომენტარების სახით ახსენით რა არის input-ი და output-ი, მოიყავნეთ შესაბამისი მაგალითები.
#input - არის მაგ ტელეფონი    output - არის მაგ ყურსასმენი 

# 3) შექმენით ცვლადი, რომელშიც შეინხავთ input ინსტრუქციით შემოტანილ მნიშვნელობას, შემდეგ შეამოწმებთ თუ რა ტიპის მონაცემი ინახება ამ ცვლადში და დაპრინტავთ.
a = input("დაწერე რაიმე რიცხვი :")
if a == int :
    print("int" + a )
elif a== str :
    print ("str" + a )
else :
    print("float"+ a)
# 4) თიოთეული მონაცემთა ტიპისთვის (str,int,float), შექმენით 5 ცვლადი და დაუწერეთ კომენტარი თუ რომელ მონაცემთა ტიპს ინახავს ცვლადი.
a = "asdf"#str
b= 12 #int
c=1.2#float

# 5) აიღეთ 3 ცვლადი, შეინახეთ განსხავებული მონაცემთა ტიპები (str,int,float), შემდეგ type ინსტრუქციის გამოყენებით შეამოწმეთ, თუ რომელ მონაცემთა ტიპს ინახავს ცვლადი.
a = "df"
b = 12
c = 1.1
print(type(a, b, c ))

# 6) მომხმარებელს შემოატანინეთ ორი სიტყვა, შეინახეთ ისინი ცვლადებში, მოახდინეთ მათი კონკატინაცია და დაბეჭდეთ.
a = input("დაწერე რაიმე სიტყვა :")
b = input("კიდე დაწერე რაიმე სიტყვა :")


# 7) მომხმარებელს შემოატანინეთ 5 რიცხვი სხვადასხვა დამოუკიდებელი input-ების სახით, თქვენი დავალებაა დაბეჭდოთ მათი საშუალო არითმეტიკული.
a = int(input("დაწერე რაიმე რიცხვი : "))
b = int(input("კიდე დაწერე რაიმე რიცხვი : "))
c = int(input("კიდევ ერთხელ დაწერე რაიმე რიცხვი : "))
d = int(input(" კიდევ დაწერე რაიმე რიცხვი : "))
e = int(input(" ბობოლოჯერ დაწერე დაწერე რაიმე რიცხვი : "))
print(a + b + c + e )// 2 


# 8) მომხმარებელს შემოატანინეთ სახელი, გვარი, ასაკი, სიმაღლე, წონა და ამ მონაცემების გამოყენებით დაბეჭდეთ ერთი დიდი წინადადება.
a = int(input("დაწერე შენი სახელი : "))
b = int(input("დაწერე შენი გვარი : "))
c = int(input("დაწერე შენი ასაკი : "))
d = int(input("დაწერე შენი სიმაღლე : "))
e = int(input("დაწერე შენი წონა  : "))
print( "შენ"+"a" + "b"+"ხარ" + "e" +"და "+"dსნ" "და ხარ " +"c" +"ესეიგი შენ ხარ მსუქანი")














