#1)გამოიტანეთ რიცხვები 0 დან 30 მდე while loop ის გამოყენებით

#2)გამოიტანეთ რიცხვები 0 დან 30 მდე for loop ის დახმრებით

#3)დაწერეთ  რა განსხვევბაა while loop სა და for loop ს შორის

#4)გამოიტანეთ რიცხვები 5 დან 50 მდე while loop ის გამოყენებით



                #საკლასო



#1
i=0
while i < 30 :
    print(i)
    i=i+1
#2
for i in range ( 0 , 30) :
    print(i)
#3 will loop არის კოდი რის დახმარებით ჩვენ ის კოდი იქამდე გრძელდება სანამ FALLS არ იქნება ხოლო for loop არის კოდი რის დახმარებითაც a-დან b-მდე გრძელდება 


#4
i=5
while i < 50 :

    print(i)
    i=i+1