# 1) მომხარებელს შემოატანინე რიცხვი, და შემდეგ შეამოწმე რომ ეს რიცხვი იყოს მეტი 15 ზე და მაგ რიცხვს გამოკლებული 5 იყოს მეტი 12 ზე
num = int(input("შეიყვანეთ რიცხვი: "))

if num > 15 and num - 5 > 12:
    print("a")
else:
    print("b")

# 2) მომხარებელს შემოტანინეთ სახელი და ერთი რიცხვი, და შეამოწმეთ რომ ეს სახელი უდრიდეს "ana" ს და  რიცხვი იყოს 50 ის ტოლი
name = input("შეიყვანეთ სახელი: ")
number = int(input("შეიყვანეთ რიცხვი: "))

if name == "ana" and number == 50:
    print("a")
else:
    print("b")