
# 1)მომხარებელს შემოატანინეთ რიცხვი, და შეამოწმეთ თუ ეს რიცხვი მეტია 18 ზე დაპრინტოს adult, სხვა შემთხვევაში kid

x = (input("რაიმე რიცხვი"))
if int(x) > 18 :
     print( "adult")

else:
     print( "kid")


 # 2)მომხარებელს შემოატანინე რიცხვი, და თუ ეს რიცხვი  მეტია 15 ზე, 1 დან ან რიცხვამდე ყველა რიცხვი დაპრინტეთ  ფორ ლუპით

x = input("რაიმე რიცხვი")
if int(x) > 15 :
     for i in range (1, (int(x))) :
         print(i)

 #3)მომხარებელს შემოატანინე სახელი, თუ ეს სახელი უდრის aleksandre ს, დაპრინტეთ "mentor" სხვა შემთხვევაში ამ ასოში თითოეული ასო ცალ ცალკე გამოიტანეთ ფორ ლუპებით
x = (input("ჩაწერე შენი სახელი"))
if x == "aleksandre" :
    print("mentor")
else :
  for i in (x) :
    print(i)