# 1) მომხარებელს შემოატანინე სტრინგი. გადაიყვანე ყველა ასო დიდ ასოებად და დაბეჭდე.
a=input("დაწერე რაიმე სიტყვა")
print(a.upper())

# 2) მომხარებელს შემოატანინე სტრინგი. გადაიყვანე ყველა ასო პატარა ასოებად.

b=input("დაწერე რაიმე სიტყვა")
print(b.lower())

# 3) მომხარებელს შემოატანინე სტრინგი და პირველი ასო დიდად გადააქციე.
c=input("დაწერე რაიმე სიტყვა")
print(c.capitalize())

# 4) მომხარებელს შემოატანინე სტრინგი. ყველა სიტყვის პირველი ასო გაადიდე.
d=input("დაწერე რაიმე წინადადება")
print(d.title())

# 5) მომხარებელს შემოატანინე სტრინგი. შეცვალე ყველა "a" სიმბოლო "o"-თი.
e=input("დაწერე რაიმე წინადადება")
print(e.replace( "a", "o" ))
 
# 6) მომხარებელს შემოატანინე სტრინგი. შეამოწმე — სულ დიდი ასოებით არის თუ არა. თუ არის დაპრინტე "string  is uppercase", სხვა შემთხვევაში "string is lowercase"
f=input("დაწერე რაიმე სიტყვა")
if f.isupper():
    print("string is uppercase")
else:
    print("string is lowercase")



# 7) მომხარებელს შემოატანინე სტრინგი. შეამოწმე — სულ პატარა ასოებით არის თუ არა. თუ არის დაპრინტე "string is lowercase", სხვა შემთხვევაში "string is uppercase"
g=input("დაწერე რაიმე სიტყვა")
if g.islower():
    print("string is lowercase")
else:
    print("string is uppercase")

# 8) მომხარებელს შემოატანინე ერთი სტრინგი და შემდგომ ერთი ცალი ასო. იპოვე პირველ სტრინგში ამ მეორე ასოს ინდექსი.
h=input("დაწერე რაიმე სიტყვა")
i=input("დაწერე რაიმე ასო")
print(h.find(i))

# 9) მომხარებელს შემოატანინე ერთი სტრინგი და შემდგომ ერთი ცალი ასო. დაითვალე რამდენჯერ გვხვდება ეს მეორე ასო სტრინგში.
j=input("დაწერე რაიმე სიტყვა")
k=input("დაწერე რაიმე ასო")
print(j.count(k))

# 10) მომხმარებელს შეაყვანინე წინადადება და წაშალე ზედმეტი space-ები თავიდან და ბოლოდან.
m=input("დაწერე რაიმე წინადადება")
print(m.strip())


# 11) მომხარებელს შემოატანინე სტრინგი. მოაშორე მხოლოდ მარცხენა მხრიდან    white space-ები.
n=input("დაწერე რაიმე წინადადება")
print(n.lstrip())

# 12) მომხარებელს შემოატანინე სტრინგი. წაშალე მხოლოდ მარჯვენა მხრიდან space-ები.
o=input("დაწერე რაიმე წინადადება")
print(o.rstrip())

# 13) მოძებნე ასო სტრინგში და დაბეჭდე ის ასო მისი ინდექსის გამოყენებით.
p=input("დაწერე რაიმე წინადადება")
r=input("დაწერე რაიმე ასო")

index=(p.find(r))
print(p[index])

