# 1)შექმენით სია, 10 ელემენტით, ნებისმიერი მონაცემთა ტიპის, შემდეგ მომხარებელს შემოატანინეთ 2 ცალი რიცხვი, პირველი რიცხვი რაც შემოიტანეს მაგ ინდექსზე მდგომი ელემენტი გამოიტანეთ, და  მეორე რიცხვი რაც შემოიტანეს სიაში მაგ ინდექსზე მდგომი ელემენტი შეცვალეთ "new element" ით
a = [10, 1, 3.14, 2, 3, 25, 4, "GOA", 99, 0]

b = int(input("შეიყვანე პირველი ინდექსი: "))
c = int(input("შეიყვანე მეორე ინდექსი: "))

print(a[b])

a[c] = "new element"
print(a)


# 2)შექმენით სია, სადაც შეინახავთ 20 ელემენტს, და გამოიტანეთ ბოლო და პირველი ელლემენტები უარყოფითი ინდექსებით
a = list(range(1, 21))

print("ბოლო ელემენტი:", a[-1])
print("პირველი ელემენტი:", a[-20])
# 3)შექმენით სია, და მომხარებელს შემოატანინეთ რიცხვი, შემდეგ თუ ეს რიცხვი მეტია 5 ზე, მაგ ინდექსზე მდგომი ელემენტი გამოიტანეთ
a = ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j"]

num = int(input("შეიყვანე რიცხვი: "))

if num > 5:
    print(a[num])
# 4)შექმენთ სია, 50 ელემენტით, შემდეგ გამოიტანეთ ბოლო 10 და პირველი 10 ელემენტები
a = list(range(1, 51))

print("პირველი 10 ელემენტი:", a[:10])
print("ბოლო 10 ელემენტი:", a[-10:])
# 5)sololearn using indexing ებამდე







