# 1)შექმენით სია, 10 ელემენტით, ნებისმიერი მონაცემთა ტიპის, შემდეგ მომხარებელს შემოატანინეთ 2 ცალი რიცხვი, პირველი რიცხვი რაც შემოიტანეს მაგ ინდექსზე მდგომი ელემენტი გამოიტანეთ, და  მეორე რიცხვი რაც შემოიტანეს სიაში მაგ ინდექსზე მდგომი ელემენტი შეცვალეთ "new element" ით
a=int(input("დაწერე რაიმე რიცხვი"))
b=int(input(" კიდევ დაწერე რაიმე რიცხვი"))

list[a , 2 , 3, b, 5, 6, 7, 8 , 0 ,10]

print(a)
B="new element"
list[a , 2 , 3, b, 5, 6, 7, 8 , 0 ,10]




       
# 2)შექმენით სია, სადაც შეინახავთ 20 ელემენტს, და გამოიტანეთ ბოლო და პირველი ელლემენტები უარყოფითი ინდექსებით
list[1 , 2 , 3, 2, 5, 6, 7, 8 , 0 ,10 , 11 , 12 , 13 , 14 , 15 , 16 , 17 , 18 , 19 , 20]
print(list[-1 and -20])
# 3)შექმენით სია, და მომხარებელს შემოატანინეთ რიცხვი, შემდეგ თუ ეს რიცხვი მეტია 5 ზე, მაგ ინდექსზე მდგომი ელემენტი გამოიტანეთ
d=int(input("დაწერე რაიმე რიცხვი"))
list[ d , 2 , 3,11 , 5, 6, 7, 8 , 0 ,10]

if d > 5 :
    print(list)


# 4)შექმენთ სია, 50 ელემენტით, შემდეგ გამოიტანეთ ბოლო 10 და პირველი 10 ელემენტები

list [2345678 , 2 , 3, 2, 5, 6, 7, 8 , 0 ,10 , 11 , 12 , 13 , 14 , 15 , 16 , 17 , 18 , 19 , 20 , 23,45,56,89,87,65,43,21,23,45,60, 43, 12,23,44,56,66,66,66,66,6,788,88,98,76,54,45 , 12,23, 34]

print(list[ -1 and -2 and -3 and -4 and -5 and -6 and -7 and-8 and -9 and  -10  and -50 and -49 and -48 and  -47 and -46 and -45 and -44 and -43 and -42 and -41 and -40 ])

# 5)sololearn using indexing ებამდე