# 1)მომხარებელს შემოატანინეტ ორი ინტეერი input ის საშულაბიეთ, შემდეგ შექმენით სია 10 ცალი ნებისმიერი ელემენტითი, და შემდეგ ამ სიაში ამოჭერით ელემენტი მომხარებლის პირველი შემოტანილი რიცხვის ინდექსიდან მომხარებლის მეორე შემოტანილი რიცხვის ინდექსამდე

a=int(input("დაწერე რაიმე რიცხვი"))
b=int(input(" კიდევ დაწერე რაიმე რიცხვი"))

lis=[1 , 2 , 3, 4, 5, 6, 7, 8 , 0 ,10]

print(lis[a:b])


# 2)იგივე რაც ზემოთა მაგრამ პიქირით, სიაში ამოჭერით ელემენტი მომხარებლის მეორე შემოტანილი რიცხვის ინდექსიდან მომხარებლის პირველი შემოტანილი რიცხვის ინდექსამდე

# მაგ:  input1: 6

a=int(input("დაწერე რაიმე რიცხვი"))
b=int(input(" კიდევ დაწერე რაიმე რიცხვი"))

lis3=[1, 2 , 3,4, 5, 6, 7, 8 , 0 ,10]

print(list[b:a])



# 3)მომხარებელს შემოატანინე  ერთი ინტეჯერი, და შექმენით ცვლადი სადაც შეინახება სტრიინგი, შემდეგ 0 ინდექსიდან მომხარებლის შემოტანილი რიცხვის  ინდექსამდე გამოიტანეთ ყველა ასო

a=int(input("დაწერე რაიმე რიცხვი"))
b="გოგა"
print(b[0:a])



