# # დაბეჭდე რიცხვები 1-დან 10-მდე.
# for i in range ( 1,11 ) :
#     print(i)
# # დაბეჭდე ყველა ლუწი რიცხვი 1-დან 20-მდე
# for i in range (2, 21, 2):
#     print(i)
# # დაბეჭდე ყველა კენტი რიცხვი 1-დან 20-მდე
# for i in range (1, 21, 2):
#     print(i)
# # მომხმარებელის შეყვანილი n-მდე დაბეჭდე რიცხვები 0-დან n-მდე.
# n = int(input("შემოიყანე რაიმე რიცხვი"))
# for i in range (0,n+1):
#     print(i)
# # მრიცხველი for-ით დათვალე 1-დან 100-მდე რიცხვების ჯამი.
# a = 0
# for i in range (1, 101):
#     a += i 
# print(a)

# # დაბეჭდე რიცხვები უკუღმა 10-დან 1-მდე.
# for i in range (10, 0,-1):
#     print(i)

# # მომხ. შეყვანილი სახელის ყველა ასო ცალ-ცალკე დაბეჭდე.
# a=input("დაწერე შენი სახელი  :")
# for i in a:
#     print(i)
# დაბეჭდე 7-ის ჯერადები 1-დან 50-მდე.
for i in range(1, 51):
    if zz
# დაბეჭდე რიცხვების კვადრატები 1-დან 10-მდე.

# #მომხ. შეიყვანს სიტყვას — და დათვალე რამდენი 'a' იქნება For-ით.


# შექმენი ციკლი: 5 ჯერ დაბეჭდოს “Hello”.

# დაბეჭდე ყველა რიცხვი 1-დან 50-მდე, რომელიც არც 2-ის, არც 5-ის ჯერადი არაა.

