# 1) კომენტარების სახით თქვენი სიტყვებით ახსენით ყველა მონაცემთა ტიპი (string, integer, float)
# string - არის როსესა 
#interger - ეს არის როდესაც მთელი რიცხვებით წერთ
# float - არის  მთელი რიცხვები და ნაშთი მაგ : 1.1  
# 2) კომენტარების სახით თქვენი სიტყვებით ახსენით რა არის ცვლადი და რაში ვიყენებთ <3
# ცვლადი არის როდესაც რაიმე რამე მიანიჭებ
# 3) ისწავლეთ ახალი სიტყვები:
# name - სახელი
# value - მნიშვნელონა
# variable - ცვლადი
# declaration - დეკლარაცია
# reinitialization - რეინიციალიზება

# 4) print() ფუნქციის დახმარებით დაბეჭდეთ 5 string ტიპის მნიშნელობა, 5 integer ტიპის მნიშვნელობა, 5 float ტიპის მნიშვნელობა.
print("a")
print("a")
print("a")
print("a")
print(1)
print(1)
print(1)
print(1)
print(1)
print(1.2)
print(1.2)
print(1.2)
print(1.2)
print(1.2)

# 5) შექმენით 5 სხვადასხვა ცვლადი. ცვლადებში შეინახეთ თქვენთვის სასურველი მნიშვნელობები და შემდეგ დაბეჭდეთ print() ფუნქციის მეშვეობით.
print("მე ვარ14")
# 6) შეასრულეთ soloearn შემდეგ თავამდე:
