# 1) გააკეთეთ 2-2 მაგალითი თითო მათემატიკურ ოპერატორებზე

print(1/1)
print(1*1)

# 2) შექმენით 5 ცვლადი -->
# პირველ ცვლადში შეინახეთ ინფორმაცია თქვენი სახელის შესაახებ.
a = "ვაჟა-ფშაველას ძმის სახელია "

# მეორე ცვლადში შეინახეთ ინფორმაცია თქვენი ასაკის შესახებ.
b = 14 +"ამ რიცხვში ვიღაცა დაიბადა"

# მესამე ცვლადში შეინახეთ ინფორმაცია თქვენი საყვარელი ფერის შესახებ.
c =  "შავი მარტივად ცხელდება და მარტივად გასცემს სითბოს"

# მეოთხე ცვლადში შეინახეთ ინფორმაცია თქვენი საყვარელი საკვების შესახებ.
d = "ხინკალი საქართველოში მიოგონე და დანა ჩანგლით თუ შეჭამ პირადად მე დაგაკლავ "
 
# მეხუთე ცვლადში შეინახეთ ინფორმაცია თქვენი საყვარელი მანქანის შესახებ.
e ="BMW m5 - The 2026/2027 BMW M5 (G90) is a 7th-generation, high-performance hybrid luxury sedan producing a massive (727text{ hp}\) and \(1,000text{ Nm}\) of torque via a V8 TwinPower Turbo engine and electric motor. It features M xDrive all-wheel drive, accelerates from \(0-100text{ km/h}\) in \(3.5text{ seconds}\), and offers refined driving dynamics with advanced hybrid"
# main task: ააგეთ ერთი დიდი წინადადება ცვლადების დახმარებით როგორც გაკვეთილზე მაგალითის სახით გავაკეთეთ.
print(a + b + c + d + e)