# 1) კომენტარების სახით თქვენი სიტყვებით ახსენით რა არის კონკატინაცია.
#კონკატინაცია - ორი ან მეტი სტრიქონის ერთმანეთთან მიბმას, ანუ გაერთიანებას ერთ მთლიან
#  სტრიქონად

# 2) ისწავლეთ ახალი სიტყვები:
# multiply - გამრავლება
# addition - მიმატება
# deduction - გამოკლება
# division - გაყოფა
# concatination - კონკატინაცია

# 3) შექმენით სამი ცვლადი num1, num2 და num3, შემდეგ კი დაპრინტეთ მათი ჯამი termian-ში.

num1 = 1
num2 = 2
num3 = 3
print(num1 + num2 + num3 )

# 4) შექმენით ორი ცვლადი length და width(მართკუთხედის გვერდები), მიანიჭეთ მნიშვნელობებად 20 და 10. გამოითვალეთ მართკუთხედის პერიმეტრი და შემდეგ კი დაპრინტეთ პასუხი termianl-ში.

length = 20
width = 10
a = (length + width)*2 
print(a)

# 5) გააკეთეთ 3-3 მაგალითი ყველა მათემატიკურ ოპერაციებზე.

print(1/1)
print(2*2)
print(1//2)

# 6) შექმენით ცვლადები და შეინახეთ მათში თქვენთვის სასურველი ინფორმაცია, შემდეგ კი ააწყეთ ერთი დიდი წინადადება ამ ცვლადებისა და მნიშვნელობების გამოყენებით.
a ="ააა"
print(a)
# 7) დაასრულეთ sololearn-ში მთლიანად 1-ლი მოდული:
