#1 ) ახსენით რა არის Control Flow

#2 ) ჩამოწერეთ და ახსენით ყველა Control Flowს ტექნიკა

#3 ) ახსენით რა არის ალგორითმი

#4 ) ახსენით რა არის ფსევდოკოდი

#5 ) თქვენი სიტყვებით ახსენით For loop

#6 ) ჩამოწერეთ რამდენი არგუმენტი შეიძლება გადაეცეს range()ფუნქცია და ახსენით რომელი რას აკეთებ

#7 ) For ციკლის მეშვეობით ტერმინალში გამოიტანეთ თქვენი საყვარელი საჭმელი 15ჯერ

#8 ) For ციკლის მეშვეობით ტერმინალში გამოიტანეთ ლუწი რიცხვები 1-1000ის ჩათვლით


                               #დავალება

#1 ) control flow  არის კოდების ერთობა

#2 ) control FLOW  ტექნიკა: sequences iterations selections

#3 ) ალგორითმი არის დეტალური ინსტრუქცია 

#4 ) ფსევდკოდი აღწერს ალგორითმს მარტივი გასაგები ენით

#5 ) for loop არის გამეორება პოგრამის რამდენგერაც მიუთითებ მაგრამ იმ რიცხვის ერთით ნალკებს პოგრამას გაიმეორებს

#6 ) range() ფუნქცია აქვს სამი არგუმენტი.პირველი ჩვეულებრივია for i in(): ოღონდ 4 გამოტოვება უნდა იყვეს            
#   მეორე for i in range(): აქ დაიწებოდა a-დან და დამთავრდება b-სთან 
#   და მესამე for i in range (a,b,c): a გვიჩვენებს დაწყება რაიმე რიცხვიდან b დასრულება რაიმე რიცხვამდე და c არის ეს ყველაფერი რამდენჯერ გაიმეოროს
for i in range(16):
    print("ხინკალი")
#8 ) 
for i in range(2,1000,2):
    print()