# 1)შექმენით სია, 10 ელემენტით, ნებისმიერი მონაცემთა ტიპის, შემდეგ მომხარებელს შემოატანინეთ 2 ცალი რიცხვი, პირველი რიცხვი რაც შემოიტანეს მაგ ინდექსზე მდგომი ელემენტი გამოიტანეთ, და  მეორე რიცხვი რაც შემოიტანეს სიაში მაგ ინდექსზე მდგომი ელემენტი შეცვალეთ "new element" ით
a=int(input("დაწერე რაიმე რიცხვი"))
b=int(input(" კიდევ დაწერე რაიმე რიცხვი"))

list = [65 , 2 , 3, 77, 5, 6, 7, 8 , 0 ,10]

print(list[a])
list[b] = "new element" 



       
# 2)შექმენით სია, სადაც შეინახავთ 20 ელემენტს, და გამოიტანეთ ბოლო და პირველი ელლემენტები უარყოფითი ინდექსებით
list = [1 , 2 , 3, 2, 5, 6, 7, 8 , 0 ,10 , 11 , 12 , 13 , 14 , 15 , 16 , 17 , 18 , 19 , 20]
print(list[-1], list[-20])


# 3)შექმენით სია, და მომხარებელს შემოატანინეთ რიცხვი, შემდეგ თუ ეს რიცხვი მეტია 5 ზე, მაგ ინდექსზე მდგომი ელემენტი გამოიტანეთ
d=int(input("დაწერე რაიმე რიცხვი"))
list=[2 , 3,11 , 5, 6, 7, 8 , 0 ,10]

if d > 5 :
    print(list[d])


# 4)შექმენთ სია, 50 ელემენტით, შემდეგ გამოიტანეთ ბოლო 10 და პირველი 10 ელემენტები

list = [2345678 , 2 , 3, 2, 5, 6, 7, 8 , 0 ,10 , 11 , 12 , 13 , 14 , 15 , 16 , 17 , 18 , 19 , 20 , 23,45,56,89,87,65,43,21,23,45,60, 43, 12,23,44,56,66,66,66,66,6,788,88,98,76,54,45 , 12,23, 34]

print(list[-1], list[-2], list[-3], list[-4], list[-5], list[-6], list[-7], list[-8], list[-9], list[-10], list[-50], list[-49], list[-48],  list[-47], list[-46], list[-45], list[-44], list[-43], list[-42], list[-41] , list[-40])