# 1)თქვენი სიტყვებით ახსენით რა არის ფუნქცია და როგორ ვწერთთ py-ში?

# ფუნქცია პროგრამირებაში არის კოდის ბლოკი რომელიც ასრულებს კონკრეტულ მოქმედებას Python-ში ფუნქციის შექმნა ხდება def სიტყვით
# 
# 2)რა არის არგუმენტი და პარამეტრი,რისთვის არის ეს 2 საჭირო?

# პარამეტრი=ცვლადი ფუნქციის აღწერის დროს
# არგუმენტი=მნიშვნელობა რომელსაც ფუნქციის გამოძახების დროს გადავცემთ 

# არგუმენტი და პარამეტრი საჭიროა, რომ ფუნქციას გადავცეთ მონაცემები და ის იმ მონაცემებით იმუშაოს.არგუმენტი და პარამეტრი საჭიროა, რომ ფუნქციას გადავცეთ მონაცემები და ის იმ მონაცემებით იმუშაოს.

# 3)რა განსხვავება print და  return შორის ფუნქციაში?
# 
# print არის რასაც ეტყვი ის გამოიტანოს return არის დაბრუნება

# 4)შექმენით ფუნქცია რომელსაც ერქმევა თქვენი საყვარელი მანაქნის სახელი,ფუნქციას უნდა გადაცეთ ბრენდი,ცხენის ძალა , sport car. ამის შემდეგ ეს ინფორმაციები გამოიტანეთ ეკრანზე


def  MY_car(model,  power, car):
    print(model, power, car)

MY_car("bmw M5", "717 to 727 horsepower ", " sport car")



# 5)შექმენით ფუნქცია Average,რომელსაც გადაცემთ 3 რიცხვს.შემდეგ კი გამოითვლით საშუალო არითმეტიკულს,საბოლოო პასუხს კი დაუმატებ 5-იანი 
def Average(a, b, c ):
    return (a + b + c)/3

print(Average(1, 2, 3 ) )
  

# 6)შექმენით ფუნქცია Even ფუნქცია სადაც გადაცემთ სიას,ამ სიაში უნდა იყოს კენტების და ლუწებიც.თქვენი დავალება არის რომ ამ რიცხვებიდან დააბრუნოთ მხოლოდ ლუწებიი

def Even(d):
    even=[]
    for i in d :
        if i % 2 == 0:
            even.append(i)
    return even 
d=Even([2 , 3,11 , 5, 6, 7, 8 , 0 ,10])
print(d)

# 7)შექმენი ფუნქცია Find_letter,სადაც გადაცემ სტრინგს.შენი დავალება არის რომ ამ სტრინგიდან დაითვალო რამდენი a ურევია მასში და გამოიტანე ეკრანზე


def find_letters(leter) :
    result = 0
    for i in leter :
        if i == "a":
            resurt=resurt + 1
    return resurt 
    
find_letters("bachana")















































