
# 1) კომენტარების სახით თქვენი სიტყვებით ახსენით ყველა მონაცემთა ტიპი (string, integer, float)
#string - ეს არის იგივე ასოები მაგ:  ა, ბ, გ.
# interger - ეს არის ჩვეულებრივი მთელი რიცხვები მაგ: 1; 2; 4;
#float - ეს არის წილადის რიცხვები მაგ: 1.2 ;3.5 .
# 2) კომენტარების სახით თქვენი სიტყვებით ახსენით რა არის ცვლადი და რაში ვიყენებთ <3
#ცვლადი არის როდესაც რაიმე რივხვს სახელს ან list რაიმე სახელი დავარქვათ და <3 გულს ნიშნავს 

# 3) ისწავლეთ ახალი სიტყვები:
# name - სახელი
# value - მნიშვნელონა
# variable - ცვლადი
# declaration - დეკლარაცია
# reinitialization - რეინიციალიზება

# 4) print() ფუნქციის დახმარებით დაბეჭდეთ 5 string ტიპის მნიშნელობა, 5 integer ტიპის მნიშვნელობა, 5 float ტიპის მნიშვნელობა.
    #str   
print("ას")
print("ას")
print("ას")
print("ას")
print("ას")
    #int
print(1)
print(2)
print(3)
print(4)
print(5)
    #float
print(1,3)
print(1,4)
print(3,4)
print(5.5)
print(6.6)


# 5) შექმენით 5 სხვადასხვა ცვლადი. ცვლადებში შეინახეთ თქვენთვის სასურველი მნიშვნელობები და შემდეგ დაბეჭდეთ print() ფუნქციის მეშვეობით.
a="asd"
print(a)
# 6) შეასრულეთ soloearn შემდეგ თავამდე:


